alibaba/AliOS-Things/platform/mcu/mkl81z7/MKL81Z7.h
/*
** ###################################################################
**     Processors:          MKL81Z128VLH7
**                          MKL81Z128VLK7
**                          MKL81Z128VLL7
**                          MKL81Z128VMC7
**                          MKL81Z128VMP7
**
**     Compilers:           Keil ARM C/C++ Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**                          MCUXpresso Compiler
**
**     Reference manual:    KL81P121M72SF0RM, Rev.2 November 2015
**     Version:             rev. 1.5, 2015-09-24
**     Build:               b171205
**
**     Abstract:
**         CMSIS Peripheral Access Layer for MKL81Z7
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2017 NXP
**
**     NXP Confidential and Proprietary - use of this software is
**     governed by the LA_OPT_FSL_OPEN_3RD_PARTY_IP License distributed
**     with this Material.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2015-04-18)
**         Initial version.
**     - rev. 1.1 (2015-05-04)
**         Update SIM, EVMSIM, QuadSPI, and I2C based on Rev0 document.
**     - rev. 1.2 (2015-08-11)
**         Correct clock configuration.
**     - rev. 1.3 (2015-08-20)
**         Align with RM Rev.1.
**     - rev. 1.4 (2015-08-28)
**         Update LPUART to add FIFO.
**     - rev. 1.5 (2015-09-24)
**         Update to align with RM Rev.1.2.
**
** ###################################################################
*/

/*!
 * @file MKL81Z7.h
 * @version 1.5
 * @date 2015-09-24
 * @brief CMSIS Peripheral Access Layer for MKL81Z7
 *
 * CMSIS Peripheral Access Layer for MKL81Z7
 */

#ifndef _MKL81Z7_H_
#define _MKL81Z7_H_                              /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0100U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0005U


/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 80                 /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Core interrupts */
  NonMaskableInt_IRQn          = -14,              /**< Non Maskable Interrupt */
  HardFault_IRQn               = -13,              /**< Cortex-M0 SV Hard Fault Interrupt */
  SVCall_IRQn                  = -5,               /**< Cortex-M0 SV Call Interrupt */
  PendSV_IRQn                  = -2,               /**< Cortex-M0 Pend SV Interrupt */
  SysTick_IRQn                 = -1,               /**< Cortex-M0 System Tick Interrupt */

  /* Device specific interrupts */
  DMA0_DMA4_IRQn               = 0,                /**< DMA channel 0, 4 transfer complete */
  DMA1_DMA5_IRQn               = 1,                /**< DMA channel 1, 5 transfer complete */
  DMA2_DMA6_IRQn               = 2,                /**< DMA channel 2, 6 transfer complete */
  DMA3_DMA7_IRQn               = 3,                /**< DMA channel 3, 7 transfer complete */
  DMA_Error_IRQn               = 4,                /**< DMA channel 0 - 7 error */
  FLEXIO0_IRQn                 = 5,                /**< Flexible IO */
  TPM0_IRQn                    = 6,                /**< Timer/PWM module 0 */
  TPM1_IRQn                    = 7,                /**< Timer/PWM module 1 */
  TPM2_IRQn                    = 8,                /**< Timer/PWM module 2 */
  PIT0_IRQn                    = 9,                /**< Periodic Interrupt Timer 0 */
  SPI0_IRQn                    = 10,               /**< Serial Peripheral Interface 0 */
  EMVSIM0_IRQn                 = 11,               /**< EMVSIM0 common interrupt */
  LPUART0_IRQn                 = 12,               /**< LPUART0 status and error */
  LPUART1_IRQn                 = 13,               /**< LPUART1 status and error */
  I2C0_IRQn                    = 14,               /**< Inter-Integrated Circuit 0 */
  QSPI0_IRQn                   = 15,               /**< QuadSPI0 interrupt */
  Tamper_IRQn                  = 16,               /**< DryIce tamper detect */
  PORTA_IRQn                   = 17,               /**< Pin detect Port A */
  PORTB_IRQn                   = 18,               /**< Pin detect Port B */
  PORTC_IRQn                   = 19,               /**< Pin detect Port C */
  PORTD_IRQn                   = 20,               /**< Pin detect Port D */
  PORTE_IRQn                   = 21,               /**< Pin detect Port E */
  LLWU_IRQn                    = 22,               /**< Low Leakage Wakeup */
  LTC0_IRQn                    = 23,               /**< Low power trusted cryptographic */
  USB0_IRQn                    = 24,               /**< USB OTG interrupt */
  ADC0_IRQn                    = 25,               /**< Analog-to-Digital Converter 0 */
  LPTMR0_IRQn                  = 26,               /**< Low-Power Timer 0 */
  RTC_Seconds_IRQn             = 27,               /**< RTC seconds */
  INTMUX0_0_IRQn               = 28,               /**< Selectable peripheral interrupt INTMUX0-0 */
  INTMUX0_1_IRQn               = 29,               /**< Selectable peripheral interrupt INTMUX0-1 */
  INTMUX0_2_IRQn               = 30,               /**< Selectable peripheral interrupt INTMUX0-2 */
  INTMUX0_3_IRQn               = 31,               /**< Selectable peripheral interrupt INTMUX0-3 */
  LPTMR1_IRQn                  = 32,               /**< Low-Power Timer 1 (INTMUX source IRQ0) */
  Reserved49_IRQn              = 33,               /**< Reserved interrupt (INTMUX source IRQ1) */
  Reserved50_IRQn              = 34,               /**< Reserved interrupt (INTMUX source IRQ2) */
  Reserved51_IRQn              = 35,               /**< Reserved interrupt (INTMUX source IRQ3) */
  SPI1_IRQn                    = 36,               /**< Serial Peripheral Interface 1 (INTMUX source IRQ4) */
  LPUART2_IRQn                 = 37,               /**< LPUART2 status and error (INTMUX source IRQ5) */
  EMVSIM1_IRQn                 = 38,               /**< EMVSIM1 common interrupt (INTMUX source IRQ6) */
  I2C1_IRQn                    = 39,               /**< Inter-Integrated Circuit 1 (INTMUX source IRQ7) */
  TSI0_IRQn                    = 40,               /**< Touch Sensing Input 0 (INTMUX source IRQ8) */
  PMC_IRQn                     = 41,               /**< PMC controller low-voltage detect, low-voltage warning (INTMUX source IRQ9) */
  FTFA_IRQn                    = 42,               /**< FTFA command complete/read collision (INTMUX source IRQ10) */
  MCG_IRQn                     = 43,               /**< Multipurpose clock generator (INTMUX source IRQ11) */
  WDOG_EWM_IRQn                = 44,               /**< Single interrupt vector for  WDOG and EWM (INTMUX source IRQ12) */
  DAC0_IRQn                    = 45,               /**< Digital-to-analog converter 0 (INTMUX source IRQ13) */
  TRNG0_IRQn                   = 46,               /**< True randon number generator (INTMUX source IRQ14) */
  Reserved63_IRQn              = 47,               /**< Reserved interrupt (INTMUX source IRQ15) */
  CMP0_IRQn                    = 48,               /**< Comparator 0 (INTMUX source IRQ16) */
  Reserved65_IRQn              = 49,               /**< Reserved interrupt (INTMUX source IRQ17) */
  RTC_Alarm_IRQn               = 50,               /**< Real time clock (INTMUX source IRQ18) */
  Reserved67_IRQn              = 51,               /**< Reserved interrupt (INTMUX source IRQ19) */
  Reserved68_IRQn              = 52,               /**< Reserved interrupt (INTMUX source IRQ20) */
  Reserved69_IRQn              = 53,               /**< Reserved interrupt (INTMUX source IRQ21) */
  Reserved70_IRQn              = 54,               /**< Reserved interrupt (INTMUX source IRQ22) */
  Reserved71_IRQn              = 55,               /**< Reserved interrupt (INTMUX source IRQ23) */
  DMA4_IRQn                    = 56,               /**< DMA channel 4 transfer complete (INTMUX source IRQ24) */
  DMA5_IRQn                    = 57,               /**< DMA channel 5 transfer complete (INTMUX source IRQ25) */
  DMA6_IRQn                    = 58,               /**< DMA channel 6 transfer complete (INTMUX source IRQ26) */
  DMA7_IRQn                    = 59,               /**< DMA channel 7 transfer complete (INTMUX source IRQ27) */
  Reserved76_IRQn              = 60,               /**< Reserved interrupt (INTMUX source IRQ28) */
  Reserved77_IRQn              = 61,               /**< Reserved interrupt (INTMUX source IRQ29) */
  Reserved78_IRQn              = 62,               /**< Reserved interrupt (INTMUX source IRQ30) */
  Reserved79_IRQn              = 63                /**< Reserved interrupt (INTMUX source IRQ31) */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M0 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M0 Core Configuration
 * @{
 */

