alibaba/AliOS-Things/platform/mcu/mkl81z7/MKL81Z7.h
/*! @name CR - DryIce Control Register */
#define DRY_CR_SWR_MASK                          (0x1U)
#define DRY_CR_SWR_SHIFT                         (0U)
#define DRY_CR_SWR(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_CR_SWR_SHIFT)) & DRY_CR_SWR_MASK)
#define DRY_CR_DEN_MASK                          (0x2U)
#define DRY_CR_DEN_SHIFT                         (1U)
#define DRY_CR_DEN(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_CR_DEN_SHIFT)) & DRY_CR_DEN_MASK)
#define DRY_CR_TFSR_MASK                         (0x4U)
#define DRY_CR_TFSR_SHIFT                        (2U)
#define DRY_CR_TFSR(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_CR_TFSR_SHIFT)) & DRY_CR_TFSR_MASK)
#define DRY_CR_UM_MASK                           (0x8U)
#define DRY_CR_UM_SHIFT                          (3U)
#define DRY_CR_UM(x)                             (((uint32_t)(((uint32_t)(x)) << DRY_CR_UM_SHIFT)) & DRY_CR_UM_MASK)
#define DRY_CR_ATCS_MASK                         (0x30U)
#define DRY_CR_ATCS_SHIFT                        (4U)
#define DRY_CR_ATCS(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_CR_ATCS_SHIFT)) & DRY_CR_ATCS_MASK)
#define DRY_CR_THYS_MASK                         (0x100U)
#define DRY_CR_THYS_SHIFT                        (8U)
#define DRY_CR_THYS(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_CR_THYS_SHIFT)) & DRY_CR_THYS_MASK)
#define DRY_CR_TPFE_MASK                         (0x200U)
#define DRY_CR_TPFE_SHIFT                        (9U)
#define DRY_CR_TPFE(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_CR_TPFE_SHIFT)) & DRY_CR_TPFE_MASK)
#define DRY_CR_TDSE_MASK                         (0x400U)
#define DRY_CR_TDSE_SHIFT                        (10U)
#define DRY_CR_TDSE(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_CR_TDSE_SHIFT)) & DRY_CR_TDSE_MASK)
#define DRY_CR_TSRE_MASK                         (0x800U)
#define DRY_CR_TSRE_SHIFT                        (11U)
#define DRY_CR_TSRE(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_CR_TSRE_SHIFT)) & DRY_CR_TSRE_MASK)
#define DRY_CR_SRF_MASK                          (0xC000U)
#define DRY_CR_SRF_SHIFT                         (14U)
#define DRY_CR_SRF(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_CR_SRF_SHIFT)) & DRY_CR_SRF_MASK)
#define DRY_CR_DPR_MASK                          (0xFFFE0000U)
#define DRY_CR_DPR_SHIFT                         (17U)
#define DRY_CR_DPR(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_CR_DPR_SHIFT)) & DRY_CR_DPR_MASK)

/*! @name SR - DryIce Status Register */
#define DRY_SR_DTF_MASK                          (0x1U)
#define DRY_SR_DTF_SHIFT                         (0U)
#define DRY_SR_DTF(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_SR_DTF_SHIFT)) & DRY_SR_DTF_MASK)
#define DRY_SR_TAF_MASK                          (0x2U)
#define DRY_SR_TAF_SHIFT                         (1U)
#define DRY_SR_TAF(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_SR_TAF_SHIFT)) & DRY_SR_TAF_MASK)
#define DRY_SR_TOF_MASK                          (0x4U)
#define DRY_SR_TOF_SHIFT                         (2U)
#define DRY_SR_TOF(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_SR_TOF_SHIFT)) & DRY_SR_TOF_MASK)
#define DRY_SR_MOF_MASK                          (0x8U)
#define DRY_SR_MOF_SHIFT                         (3U)
#define DRY_SR_MOF(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_SR_MOF_SHIFT)) & DRY_SR_MOF_MASK)
#define DRY_SR_VTF_MASK                          (0x10U)
#define DRY_SR_VTF_SHIFT                         (4U)
#define DRY_SR_VTF(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_SR_VTF_SHIFT)) & DRY_SR_VTF_MASK)
#define DRY_SR_CTF_MASK                          (0x20U)
#define DRY_SR_CTF_SHIFT                         (5U)
#define DRY_SR_CTF(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_SR_CTF_SHIFT)) & DRY_SR_CTF_MASK)
#define DRY_SR_TTF_MASK                          (0x40U)
#define DRY_SR_TTF_SHIFT                         (6U)
#define DRY_SR_TTF(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_SR_TTF_SHIFT)) & DRY_SR_TTF_MASK)
#define DRY_SR_STF_MASK                          (0x80U)
#define DRY_SR_STF_SHIFT                         (7U)
#define DRY_SR_STF(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_SR_STF_SHIFT)) & DRY_SR_STF_MASK)
#define DRY_SR_FSF_MASK                          (0x100U)
#define DRY_SR_FSF_SHIFT                         (8U)
#define DRY_SR_FSF(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_SR_FSF_SHIFT)) & DRY_SR_FSF_MASK)
#define DRY_SR_TMF_MASK                          (0x200U)
#define DRY_SR_TMF_SHIFT                         (9U)
#define DRY_SR_TMF(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_SR_TMF_SHIFT)) & DRY_SR_TMF_MASK)
#define DRY_SR_TPF_MASK                          (0xFF0000U)
#define DRY_SR_TPF_SHIFT                         (16U)
#define DRY_SR_TPF(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_SR_TPF_SHIFT)) & DRY_SR_TPF_MASK)

/*! @name LR - DryIce Lock Register */
#define DRY_LR_KVL_MASK                          (0x2U)
#define DRY_LR_KVL_SHIFT                         (1U)
#define DRY_LR_KVL(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_LR_KVL_SHIFT)) & DRY_LR_KVL_MASK)
#define DRY_LR_KWL_MASK                          (0x4U)
#define DRY_LR_KWL_SHIFT                         (2U)
#define DRY_LR_KWL(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_LR_KWL_SHIFT)) & DRY_LR_KWL_MASK)
#define DRY_LR_KRL_MASK                          (0x8U)
#define DRY_LR_KRL_SHIFT                         (3U)
#define DRY_LR_KRL(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_LR_KRL_SHIFT)) & DRY_LR_KRL_MASK)
#define DRY_LR_CRL_MASK                          (0x10U)
#define DRY_LR_CRL_SHIFT                         (4U)
#define DRY_LR_CRL(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_LR_CRL_SHIFT)) & DRY_LR_CRL_MASK)
#define DRY_LR_SRL_MASK                          (0x20U)
#define DRY_LR_SRL_SHIFT                         (5U)
#define DRY_LR_SRL(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_LR_SRL_SHIFT)) & DRY_LR_SRL_MASK)
#define DRY_LR_LRL_MASK                          (0x40U)
#define DRY_LR_LRL_SHIFT                         (6U)
#define DRY_LR_LRL(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_LR_LRL_SHIFT)) & DRY_LR_LRL_MASK)
#define DRY_LR_IEL_MASK                          (0x80U)
#define DRY_LR_IEL_SHIFT                         (7U)
#define DRY_LR_IEL(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_LR_IEL_SHIFT)) & DRY_LR_IEL_MASK)
#define DRY_LR_TSL_MASK                          (0x100U)
#define DRY_LR_TSL_SHIFT                         (8U)
#define DRY_LR_TSL(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_LR_TSL_SHIFT)) & DRY_LR_TSL_MASK)
#define DRY_LR_TEL_MASK                          (0x200U)
#define DRY_LR_TEL_SHIFT                         (9U)
#define DRY_LR_TEL(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_LR_TEL_SHIFT)) & DRY_LR_TEL_MASK)
#define DRY_LR_PDL_MASK                          (0x400U)
#define DRY_LR_PDL_SHIFT                         (10U)
#define DRY_LR_PDL(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_LR_PDL_SHIFT)) & DRY_LR_PDL_MASK)
#define DRY_LR_PPL_MASK                          (0x800U)
#define DRY_LR_PPL_SHIFT                         (11U)
#define DRY_LR_PPL(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_LR_PPL_SHIFT)) & DRY_LR_PPL_MASK)
#define DRY_LR_ATL_MASK                          (0x3000U)
#define DRY_LR_ATL_SHIFT                         (12U)
#define DRY_LR_ATL(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_LR_ATL_SHIFT)) & DRY_LR_ATL_MASK)
#define DRY_LR_GFL_MASK                          (0xFF0000U)
#define DRY_LR_GFL_SHIFT                         (16U)
#define DRY_LR_GFL(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_LR_GFL_SHIFT)) & DRY_LR_GFL_MASK)

/*! @name IER - DryIce Interrupt Enable Register */
#define DRY_IER_DTIE_MASK                        (0x1U)
#define DRY_IER_DTIE_SHIFT                       (0U)
#define DRY_IER_DTIE(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_IER_DTIE_SHIFT)) & DRY_IER_DTIE_MASK)
#define DRY_IER_TOIE_MASK                        (0x4U)
#define DRY_IER_TOIE_SHIFT                       (2U)
#define DRY_IER_TOIE(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_IER_TOIE_SHIFT)) & DRY_IER_TOIE_MASK)
#define DRY_IER_MOIE_MASK                        (0x8U)
#define DRY_IER_MOIE_SHIFT                       (3U)
#define DRY_IER_MOIE(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_IER_MOIE_SHIFT)) & DRY_IER_MOIE_MASK)
#define DRY_IER_VTIE_MASK                        (0x10U)
#define DRY_IER_VTIE_SHIFT                       (4U)
#define DRY_IER_VTIE(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_IER_VTIE_SHIFT)) & DRY_IER_VTIE_MASK)
#define DRY_IER_CTIE_MASK                        (0x20U)
#define DRY_IER_CTIE_SHIFT                       (5U)
#define DRY_IER_CTIE(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_IER_CTIE_SHIFT)) & DRY_IER_CTIE_MASK)
#define DRY_IER_TTIE_MASK                        (0x40U)
#define DRY_IER_TTIE_SHIFT                       (6U)
#define DRY_IER_TTIE(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_IER_TTIE_SHIFT)) & DRY_IER_TTIE_MASK)
#define DRY_IER_STIE_MASK                        (0x80U)
#define DRY_IER_STIE_SHIFT                       (7U)
#define DRY_IER_STIE(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_IER_STIE_SHIFT)) & DRY_IER_STIE_MASK)
#define DRY_IER_FSIE_MASK                        (0x100U)
#define DRY_IER_FSIE_SHIFT                       (8U)
#define DRY_IER_FSIE(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_IER_FSIE_SHIFT)) & DRY_IER_FSIE_MASK)
#define DRY_IER_TMIE_MASK                        (0x200U)
#define DRY_IER_TMIE_SHIFT                       (9U)
#define DRY_IER_TMIE(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_IER_TMIE_SHIFT)) & DRY_IER_TMIE_MASK)
#define DRY_IER_TPIE_MASK                        (0xFF0000U)
#define DRY_IER_TPIE_SHIFT                       (16U)
#define DRY_IER_TPIE(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_IER_TPIE_SHIFT)) & DRY_IER_TPIE_MASK)

/*! @name TSR - DryIce Tamper Seconds Register */
#define DRY_TSR_TTS_MASK                         (0xFFFFFFFFU)
#define DRY_TSR_TTS_SHIFT                        (0U)
#define DRY_TSR_TTS(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_TSR_TTS_SHIFT)) & DRY_TSR_TTS_MASK)

/*! @name TER - DryIce Tamper Enable Register */
#define DRY_TER_TOE_MASK                         (0x4U)
#define DRY_TER_TOE_SHIFT                        (2U)
#define DRY_TER_TOE(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_TER_TOE_SHIFT)) & DRY_TER_TOE_MASK)
#define DRY_TER_MOE_MASK                         (0x8U)
#define DRY_TER_MOE_SHIFT                        (3U)
#define DRY_TER_MOE(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_TER_MOE_SHIFT)) & DRY_TER_MOE_MASK)
#define DRY_TER_VTE_MASK                         (0x10U)
#define DRY_TER_VTE_SHIFT                        (4U)
#define DRY_TER_VTE(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_TER_VTE_SHIFT)) & DRY_TER_VTE_MASK)
#define DRY_TER_CTE_MASK                         (0x20U)
#define DRY_TER_CTE_SHIFT                        (5U)
#define DRY_TER_CTE(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_TER_CTE_SHIFT)) & DRY_TER_CTE_MASK)
#define DRY_TER_TTE_MASK                         (0x40U)
#define DRY_TER_TTE_SHIFT                        (6U)
#define DRY_TER_TTE(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_TER_TTE_SHIFT)) & DRY_TER_TTE_MASK)
#define DRY_TER_STE_MASK                         (0x80U)
#define DRY_TER_STE_SHIFT                        (7U)
#define DRY_TER_STE(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_TER_STE_SHIFT)) & DRY_TER_STE_MASK)
#define DRY_TER_FSE_MASK                         (0x100U)
#define DRY_TER_FSE_SHIFT                        (8U)
#define DRY_TER_FSE(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_TER_FSE_SHIFT)) & DRY_TER_FSE_MASK)
#define DRY_TER_TME_MASK                         (0x200U)
#define DRY_TER_TME_SHIFT                        (9U)
#define DRY_TER_TME(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_TER_TME_SHIFT)) & DRY_TER_TME_MASK)
#define DRY_TER_TPE_MASK                         (0xFF0000U)
#define DRY_TER_TPE_SHIFT                        (16U)
#define DRY_TER_TPE(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_TER_TPE_SHIFT)) & DRY_TER_TPE_MASK)

/*! @name PDR - DryIce Pin Direction Register */
#define DRY_PDR_TPD_MASK                         (0xFFU)
#define DRY_PDR_TPD_SHIFT                        (0U)
#define DRY_PDR_TPD(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_PDR_TPD_SHIFT)) & DRY_PDR_TPD_MASK)
#define DRY_PDR_TPOD_MASK                        (0xFF0000U)
#define DRY_PDR_TPOD_SHIFT                       (16U)
#define DRY_PDR_TPOD(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_PDR_TPOD_SHIFT)) & DRY_PDR_TPOD_MASK)

