alibaba/AliOS-Things/platform/mcu/mkl81z7/MKL81Z7.h
/*! @name RAC - DryIce Read Access Control Register */
#define DRY_RAC_SKVR_MASK                        (0x2U)
#define DRY_RAC_SKVR_SHIFT                       (1U)
#define DRY_RAC_SKVR(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_RAC_SKVR_SHIFT)) & DRY_RAC_SKVR_MASK)
#define DRY_RAC_SKWRR_MASK                       (0x4U)
#define DRY_RAC_SKWRR_SHIFT                      (2U)
#define DRY_RAC_SKWRR(x)                         (((uint32_t)(((uint32_t)(x)) << DRY_RAC_SKWRR_SHIFT)) & DRY_RAC_SKWRR_MASK)
#define DRY_RAC_SKRRR_MASK                       (0x8U)
#define DRY_RAC_SKRRR_SHIFT                      (3U)
#define DRY_RAC_SKRRR(x)                         (((uint32_t)(((uint32_t)(x)) << DRY_RAC_SKRRR_SHIFT)) & DRY_RAC_SKRRR_MASK)
#define DRY_RAC_CRR_MASK                         (0x10U)
#define DRY_RAC_CRR_SHIFT                        (4U)
#define DRY_RAC_CRR(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_RAC_CRR_SHIFT)) & DRY_RAC_CRR_MASK)
#define DRY_RAC_SRR_MASK                         (0x20U)
#define DRY_RAC_SRR_SHIFT                        (5U)
#define DRY_RAC_SRR(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_RAC_SRR_SHIFT)) & DRY_RAC_SRR_MASK)
#define DRY_RAC_LRR_MASK                         (0x40U)
#define DRY_RAC_LRR_SHIFT                        (6U)
#define DRY_RAC_LRR(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_RAC_LRR_SHIFT)) & DRY_RAC_LRR_MASK)
#define DRY_RAC_IER_MASK                         (0x80U)
#define DRY_RAC_IER_SHIFT                        (7U)
#define DRY_RAC_IER(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_RAC_IER_SHIFT)) & DRY_RAC_IER_MASK)
#define DRY_RAC_TSRR_MASK                        (0x100U)
#define DRY_RAC_TSRR_SHIFT                       (8U)
#define DRY_RAC_TSRR(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_RAC_TSRR_SHIFT)) & DRY_RAC_TSRR_MASK)
#define DRY_RAC_TER_MASK                         (0x200U)
#define DRY_RAC_TER_SHIFT                        (9U)
#define DRY_RAC_TER(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_RAC_TER_SHIFT)) & DRY_RAC_TER_MASK)
#define DRY_RAC_PDR_MASK                         (0x400U)
#define DRY_RAC_PDR_SHIFT                        (10U)
#define DRY_RAC_PDR(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_RAC_PDR_SHIFT)) & DRY_RAC_PDR_MASK)
#define DRY_RAC_PPR_MASK                         (0x800U)
#define DRY_RAC_PPR_SHIFT                        (11U)
#define DRY_RAC_PPR(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_RAC_PPR_SHIFT)) & DRY_RAC_PPR_MASK)
#define DRY_RAC_ATR_MASK                         (0x3000U)
#define DRY_RAC_ATR_SHIFT                        (12U)
#define DRY_RAC_ATR(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_RAC_ATR_SHIFT)) & DRY_RAC_ATR_MASK)
#define DRY_RAC_GFR_MASK                         (0xFF0000U)
#define DRY_RAC_GFR_SHIFT                        (16U)
#define DRY_RAC_GFR(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_RAC_GFR_SHIFT)) & DRY_RAC_GFR_MASK)

/*! @name SKR - Secure Key Register */
#define DRY_SKR_SK_MASK                          (0xFFFFFFFFU)
#define DRY_SKR_SK_SHIFT                         (0U)
#define DRY_SKR_SK(x)                            (((uint32_t)(((uint32_t)(x)) << DRY_SKR_SK_SHIFT)) & DRY_SKR_SK_MASK)

/* The count of DRY_SKR */
#define DRY_SKR_COUNT                            (8U)

/*! @name SWAC - Secure Write Access Control */
#define DRY_SWAC_SKRW_MASK                       (0xFFU)
#define DRY_SWAC_SKRW_SHIFT                      (0U)
#define DRY_SWAC_SKRW(x)                         (((uint32_t)(((uint32_t)(x)) << DRY_SWAC_SKRW_SHIFT)) & DRY_SWAC_SKRW_MASK)

/*! @name SRAC - Secure Read Access Control */
#define DRY_SRAC_SKRR_MASK                       (0xFFU)
#define DRY_SRAC_SKRR_SHIFT                      (0U)
#define DRY_SRAC_SKRR(x)                         (((uint32_t)(((uint32_t)(x)) << DRY_SRAC_SKRR_SHIFT)) & DRY_SRAC_SKRR_MASK)


/*!
 * @}
 */ /* end of group DRY_Register_Masks */


/* DRY - Peripheral instance base addresses */
/** Peripheral DRY base address */
#define DRY_BASE                                 (0x40042000u)
/** Peripheral DRY base pointer */
#define DRY                                      ((DRY_Type *)DRY_BASE)
/** Array initializer of DRY peripheral base addresses */
#define DRY_BASE_ADDRS                           { DRY_BASE }
/** Array initializer of DRY peripheral base pointers */
#define DRY_BASE_PTRS                            { DRY }
/** Interrupt vectors for the DRY peripheral type */
#define DRY_IRQS                                 { Tamper_IRQn }

/*!
 * @}
 */ /* end of group DRY_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- EMVSIM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EMVSIM_Peripheral_Access_Layer EMVSIM Peripheral Access Layer
 * @{
 */

/** EMVSIM - Register Layout Typedef */
typedef struct {
  __I  uint32_t VER_ID;                            /**< Version ID Register, offset: 0x0 */
  __I  uint32_t PARAM;                             /**< Parameter Register, offset: 0x4 */
  __IO uint32_t CLKCFG;                            /**< Clock Configuration Register, offset: 0x8 */
  __IO uint32_t DIVISOR;                           /**< Baud Rate Divisor Register, offset: 0xC */
  __IO uint32_t CTRL;                              /**< Control Register, offset: 0x10 */
  __IO uint32_t INT_MASK;                          /**< Interrupt Mask Register, offset: 0x14 */
  __IO uint32_t RX_THD;                            /**< Receiver Threshold Register, offset: 0x18 */
  __IO uint32_t TX_THD;                            /**< Transmitter Threshold Register, offset: 0x1C */
  __IO uint32_t RX_STATUS;                         /**< Receive Status Register, offset: 0x20 */
  __IO uint32_t TX_STATUS;                         /**< Transmitter Status Register, offset: 0x24 */
  __IO uint32_t PCSR;                              /**< Port Control and Status Register, offset: 0x28 */
  __I  uint32_t RX_BUF;                            /**< Receive Data Read Buffer, offset: 0x2C */
  __O  uint32_t TX_BUF;                            /**< Transmit Data Buffer, offset: 0x30 */
  __IO uint32_t TX_GETU;                           /**< Transmitter Guard ETU Value Register, offset: 0x34 */
  __IO uint32_t CWT_VAL;                           /**< Character Wait Time Value Register, offset: 0x38 */
  __IO uint32_t BWT_VAL;                           /**< Block Wait Time Value Register, offset: 0x3C */
  __IO uint32_t BGT_VAL;                           /**< Block Guard Time Value Register, offset: 0x40 */
  __IO uint32_t GPCNT0_VAL;                        /**< General Purpose Counter 0 Timeout Value Register, offset: 0x44 */
  __IO uint32_t GPCNT1_VAL;                        /**< General Purpose Counter 1 Timeout Value, offset: 0x48 */
} EMVSIM_Type;

/* ----------------------------------------------------------------------------
   -- EMVSIM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EMVSIM_Register_Masks EMVSIM Register Masks
 * @{
 */

/*! @name VER_ID - Version ID Register */
#define EMVSIM_VER_ID_VER_MASK                   (0xFFFFFFFFU)
#define EMVSIM_VER_ID_VER_SHIFT                  (0U)
#define EMVSIM_VER_ID_VER(x)                     (((uint32_t)(((uint32_t)(x)) << EMVSIM_VER_ID_VER_SHIFT)) & EMVSIM_VER_ID_VER_MASK)

/*! @name PARAM - Parameter Register */
#define EMVSIM_PARAM_RX_FIFO_DEPTH_MASK          (0xFFU)
#define EMVSIM_PARAM_RX_FIFO_DEPTH_SHIFT         (0U)
#define EMVSIM_PARAM_RX_FIFO_DEPTH(x)            (((uint32_t)(((uint32_t)(x)) << EMVSIM_PARAM_RX_FIFO_DEPTH_SHIFT)) & EMVSIM_PARAM_RX_FIFO_DEPTH_MASK)
#define EMVSIM_PARAM_TX_FIFO_DEPTH_MASK          (0xFF00U)
#define EMVSIM_PARAM_TX_FIFO_DEPTH_SHIFT         (8U)
#define EMVSIM_PARAM_TX_FIFO_DEPTH(x)            (((uint32_t)(((uint32_t)(x)) << EMVSIM_PARAM_TX_FIFO_DEPTH_SHIFT)) & EMVSIM_PARAM_TX_FIFO_DEPTH_MASK)

/*! @name CLKCFG - Clock Configuration Register */
#define EMVSIM_CLKCFG_CLK_PRSC_MASK              (0xFFU)
#define EMVSIM_CLKCFG_CLK_PRSC_SHIFT             (0U)
#define EMVSIM_CLKCFG_CLK_PRSC(x)                (((uint32_t)(((uint32_t)(x)) << EMVSIM_CLKCFG_CLK_PRSC_SHIFT)) & EMVSIM_CLKCFG_CLK_PRSC_MASK)
#define EMVSIM_CLKCFG_GPCNT1_CLK_SEL_MASK        (0x300U)
#define EMVSIM_CLKCFG_GPCNT1_CLK_SEL_SHIFT       (8U)
#define EMVSIM_CLKCFG_GPCNT1_CLK_SEL(x)          (((uint32_t)(((uint32_t)(x)) << EMVSIM_CLKCFG_GPCNT1_CLK_SEL_SHIFT)) & EMVSIM_CLKCFG_GPCNT1_CLK_SEL_MASK)
#define EMVSIM_CLKCFG_GPCNT0_CLK_SEL_MASK        (0xC00U)
#define EMVSIM_CLKCFG_GPCNT0_CLK_SEL_SHIFT       (10U)
#define EMVSIM_CLKCFG_GPCNT0_CLK_SEL(x)          (((uint32_t)(((uint32_t)(x)) << EMVSIM_CLKCFG_GPCNT0_CLK_SEL_SHIFT)) & EMVSIM_CLKCFG_GPCNT0_CLK_SEL_MASK)

