alibaba/AliOS-Things/platform/mcu/mkl81z7/MKL81Z7.h
/*! @name IER - RTC Interrupt Enable Register */
#define RTC_IER_TIIE_MASK                        (0x1U)
#define RTC_IER_TIIE_SHIFT                       (0U)
#define RTC_IER_TIIE(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_IER_TIIE_SHIFT)) & RTC_IER_TIIE_MASK)
#define RTC_IER_TOIE_MASK                        (0x2U)
#define RTC_IER_TOIE_SHIFT                       (1U)
#define RTC_IER_TOIE(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_IER_TOIE_SHIFT)) & RTC_IER_TOIE_MASK)
#define RTC_IER_TAIE_MASK                        (0x4U)
#define RTC_IER_TAIE_SHIFT                       (2U)
#define RTC_IER_TAIE(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_IER_TAIE_SHIFT)) & RTC_IER_TAIE_MASK)
#define RTC_IER_MOIE_MASK                        (0x8U)
#define RTC_IER_MOIE_SHIFT                       (3U)
#define RTC_IER_MOIE(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_IER_MOIE_SHIFT)) & RTC_IER_MOIE_MASK)
#define RTC_IER_TSIE_MASK                        (0x10U)
#define RTC_IER_TSIE_SHIFT                       (4U)
#define RTC_IER_TSIE(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_IER_TSIE_SHIFT)) & RTC_IER_TSIE_MASK)
#define RTC_IER_WPON_MASK                        (0x80U)
#define RTC_IER_WPON_SHIFT                       (7U)
#define RTC_IER_WPON(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_IER_WPON_SHIFT)) & RTC_IER_WPON_MASK)

/*! @name TTSR - RTC Tamper Time Seconds Register */
#define RTC_TTSR_TTS_MASK                        (0xFFFFFFFFU)
#define RTC_TTSR_TTS_SHIFT                       (0U)
#define RTC_TTSR_TTS(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_TTSR_TTS_SHIFT)) & RTC_TTSR_TTS_MASK)

/*! @name MER - RTC Monotonic Enable Register */
#define RTC_MER_MCE_MASK                         (0x10U)
#define RTC_MER_MCE_SHIFT                        (4U)
#define RTC_MER_MCE(x)                           (((uint32_t)(((uint32_t)(x)) << RTC_MER_MCE_SHIFT)) & RTC_MER_MCE_MASK)

/*! @name MCLR - RTC Monotonic Counter Low Register */
#define RTC_MCLR_MCL_MASK                        (0xFFFFFFFFU)
#define RTC_MCLR_MCL_SHIFT                       (0U)
#define RTC_MCLR_MCL(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_MCLR_MCL_SHIFT)) & RTC_MCLR_MCL_MASK)

/*! @name MCHR - RTC Monotonic Counter High Register */
#define RTC_MCHR_MCH_MASK                        (0xFFFFFFFFU)
#define RTC_MCHR_MCH_SHIFT                       (0U)
#define RTC_MCHR_MCH(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_MCHR_MCH_SHIFT)) & RTC_MCHR_MCH_MASK)

/*! @name TER - RTC Tamper Enable Register */
#define RTC_TER_VTE_MASK                         (0x2U)
#define RTC_TER_VTE_SHIFT                        (1U)
#define RTC_TER_VTE(x)                           (((uint32_t)(((uint32_t)(x)) << RTC_TER_VTE_SHIFT)) & RTC_TER_VTE_MASK)
#define RTC_TER_CTE_MASK                         (0x4U)
#define RTC_TER_CTE_SHIFT                        (2U)
#define RTC_TER_CTE(x)                           (((uint32_t)(((uint32_t)(x)) << RTC_TER_CTE_SHIFT)) & RTC_TER_CTE_MASK)
#define RTC_TER_TTE_MASK                         (0x8U)
#define RTC_TER_TTE_SHIFT                        (3U)
#define RTC_TER_TTE(x)                           (((uint32_t)(((uint32_t)(x)) << RTC_TER_TTE_SHIFT)) & RTC_TER_TTE_MASK)
#define RTC_TER_FSE_MASK                         (0x10U)
#define RTC_TER_FSE_SHIFT                        (4U)
#define RTC_TER_FSE(x)                           (((uint32_t)(((uint32_t)(x)) << RTC_TER_FSE_SHIFT)) & RTC_TER_FSE_MASK)
#define RTC_TER_TME_MASK                         (0x20U)
#define RTC_TER_TME_SHIFT                        (5U)
#define RTC_TER_TME(x)                           (((uint32_t)(((uint32_t)(x)) << RTC_TER_TME_SHIFT)) & RTC_TER_TME_MASK)

/*! @name TDR - RTC Tamper Detect Register */
#define RTC_TDR_VTF_MASK                         (0x2U)
#define RTC_TDR_VTF_SHIFT                        (1U)
#define RTC_TDR_VTF(x)                           (((uint32_t)(((uint32_t)(x)) << RTC_TDR_VTF_SHIFT)) & RTC_TDR_VTF_MASK)
#define RTC_TDR_CTF_MASK                         (0x4U)
#define RTC_TDR_CTF_SHIFT                        (2U)
#define RTC_TDR_CTF(x)                           (((uint32_t)(((uint32_t)(x)) << RTC_TDR_CTF_SHIFT)) & RTC_TDR_CTF_MASK)
#define RTC_TDR_TTF_MASK                         (0x8U)
#define RTC_TDR_TTF_SHIFT                        (3U)
#define RTC_TDR_TTF(x)                           (((uint32_t)(((uint32_t)(x)) << RTC_TDR_TTF_SHIFT)) & RTC_TDR_TTF_MASK)
#define RTC_TDR_FSF_MASK                         (0x10U)
#define RTC_TDR_FSF_SHIFT                        (4U)
#define RTC_TDR_FSF(x)                           (((uint32_t)(((uint32_t)(x)) << RTC_TDR_FSF_SHIFT)) & RTC_TDR_FSF_MASK)
#define RTC_TDR_TMF_MASK                         (0x20U)
#define RTC_TDR_TMF_SHIFT                        (5U)
#define RTC_TDR_TMF(x)                           (((uint32_t)(((uint32_t)(x)) << RTC_TDR_TMF_SHIFT)) & RTC_TDR_TMF_MASK)

/*! @name TTR - RTC Tamper Trim Register */
#define RTC_TTR_VDTL_MASK                        (0x7U)
#define RTC_TTR_VDTL_SHIFT                       (0U)
#define RTC_TTR_VDTL(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_TTR_VDTL_SHIFT)) & RTC_TTR_VDTL_MASK)
#define RTC_TTR_VDTH_MASK                        (0x38U)
#define RTC_TTR_VDTH_SHIFT                       (3U)
#define RTC_TTR_VDTH(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_TTR_VDTH_SHIFT)) & RTC_TTR_VDTH_MASK)
#define RTC_TTR_CDTL_MASK                        (0x1C0U)
#define RTC_TTR_CDTL_SHIFT                       (6U)
#define RTC_TTR_CDTL(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_TTR_CDTL_SHIFT)) & RTC_TTR_CDTL_MASK)
#define RTC_TTR_CDTH_MASK                        (0xE00U)
#define RTC_TTR_CDTH_SHIFT                       (9U)
#define RTC_TTR_CDTH(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_TTR_CDTH_SHIFT)) & RTC_TTR_CDTH_MASK)
#define RTC_TTR_TDTL_MASK                        (0x1F000U)
#define RTC_TTR_TDTL_SHIFT                       (12U)
#define RTC_TTR_TDTL(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_TTR_TDTL_SHIFT)) & RTC_TTR_TDTL_MASK)
#define RTC_TTR_TDTH_MASK                        (0x3E0000U)
#define RTC_TTR_TDTH_SHIFT                       (17U)
#define RTC_TTR_TDTH(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_TTR_TDTH_SHIFT)) & RTC_TTR_TDTH_MASK)

/*! @name TIR - RTC Tamper Interrupt Register */
#define RTC_TIR_VTIE_MASK                        (0x2U)
#define RTC_TIR_VTIE_SHIFT                       (1U)
#define RTC_TIR_VTIE(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_TIR_VTIE_SHIFT)) & RTC_TIR_VTIE_MASK)
#define RTC_TIR_CTIE_MASK                        (0x4U)
#define RTC_TIR_CTIE_SHIFT                       (2U)
#define RTC_TIR_CTIE(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_TIR_CTIE_SHIFT)) & RTC_TIR_CTIE_MASK)
#define RTC_TIR_TTIE_MASK                        (0x8U)
#define RTC_TIR_TTIE_SHIFT                       (3U)
#define RTC_TIR_TTIE(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_TIR_TTIE_SHIFT)) & RTC_TIR_TTIE_MASK)
#define RTC_TIR_FSIE_MASK                        (0x10U)
#define RTC_TIR_FSIE_SHIFT                       (4U)
#define RTC_TIR_FSIE(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_TIR_FSIE_SHIFT)) & RTC_TIR_FSIE_MASK)
#define RTC_TIR_TMIE_MASK                        (0x20U)
#define RTC_TIR_TMIE_SHIFT                       (5U)
#define RTC_TIR_TMIE(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_TIR_TMIE_SHIFT)) & RTC_TIR_TMIE_MASK)

/*! @name WAR - RTC Write Access Register */
#define RTC_WAR_TSRW_MASK                        (0x1U)
#define RTC_WAR_TSRW_SHIFT                       (0U)
#define RTC_WAR_TSRW(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_WAR_TSRW_SHIFT)) & RTC_WAR_TSRW_MASK)
#define RTC_WAR_TPRW_MASK                        (0x2U)
#define RTC_WAR_TPRW_SHIFT                       (1U)
#define RTC_WAR_TPRW(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_WAR_TPRW_SHIFT)) & RTC_WAR_TPRW_MASK)
#define RTC_WAR_TARW_MASK                        (0x4U)
#define RTC_WAR_TARW_SHIFT                       (2U)
#define RTC_WAR_TARW(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_WAR_TARW_SHIFT)) & RTC_WAR_TARW_MASK)
#define RTC_WAR_TCRW_MASK                        (0x8U)
#define RTC_WAR_TCRW_SHIFT                       (3U)
#define RTC_WAR_TCRW(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_WAR_TCRW_SHIFT)) & RTC_WAR_TCRW_MASK)
#define RTC_WAR_CRW_MASK                         (0x10U)
#define RTC_WAR_CRW_SHIFT                        (4U)
#define RTC_WAR_CRW(x)                           (((uint32_t)(((uint32_t)(x)) << RTC_WAR_CRW_SHIFT)) & RTC_WAR_CRW_MASK)
#define RTC_WAR_SRW_MASK                         (0x20U)
#define RTC_WAR_SRW_SHIFT                        (5U)
#define RTC_WAR_SRW(x)                           (((uint32_t)(((uint32_t)(x)) << RTC_WAR_SRW_SHIFT)) & RTC_WAR_SRW_MASK)
#define RTC_WAR_LRW_MASK                         (0x40U)
#define RTC_WAR_LRW_SHIFT                        (6U)
#define RTC_WAR_LRW(x)                           (((uint32_t)(((uint32_t)(x)) << RTC_WAR_LRW_SHIFT)) & RTC_WAR_LRW_MASK)
#define RTC_WAR_IERW_MASK                        (0x80U)
#define RTC_WAR_IERW_SHIFT                       (7U)
#define RTC_WAR_IERW(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_WAR_IERW_SHIFT)) & RTC_WAR_IERW_MASK)
#define RTC_WAR_TTSW_MASK                        (0x100U)
#define RTC_WAR_TTSW_SHIFT                       (8U)
#define RTC_WAR_TTSW(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_WAR_TTSW_SHIFT)) & RTC_WAR_TTSW_MASK)
#define RTC_WAR_MERW_MASK                        (0x200U)
#define RTC_WAR_MERW_SHIFT                       (9U)
#define RTC_WAR_MERW(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_WAR_MERW_SHIFT)) & RTC_WAR_MERW_MASK)
#define RTC_WAR_MCLW_MASK                        (0x400U)
#define RTC_WAR_MCLW_SHIFT                       (10U)
#define RTC_WAR_MCLW(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_WAR_MCLW_SHIFT)) & RTC_WAR_MCLW_MASK)
#define RTC_WAR_MCHW_MASK                        (0x800U)
#define RTC_WAR_MCHW_SHIFT                       (11U)
#define RTC_WAR_MCHW(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_WAR_MCHW_SHIFT)) & RTC_WAR_MCHW_MASK)
#define RTC_WAR_TERW_MASK                        (0x1000U)
#define RTC_WAR_TERW_SHIFT                       (12U)
#define RTC_WAR_TERW(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_WAR_TERW_SHIFT)) & RTC_WAR_TERW_MASK)
#define RTC_WAR_TDRW_MASK                        (0x2000U)
#define RTC_WAR_TDRW_SHIFT                       (13U)
#define RTC_WAR_TDRW(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_WAR_TDRW_SHIFT)) & RTC_WAR_TDRW_MASK)
#define RTC_WAR_TTRW_MASK                        (0x4000U)
#define RTC_WAR_TTRW_SHIFT                       (14U)
#define RTC_WAR_TTRW(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_WAR_TTRW_SHIFT)) & RTC_WAR_TTRW_MASK)
#define RTC_WAR_TIRW_MASK                        (0x8000U)
#define RTC_WAR_TIRW_SHIFT                       (15U)
#define RTC_WAR_TIRW(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_WAR_TIRW_SHIFT)) & RTC_WAR_TIRW_MASK)

